


//*splice &  slice 






const test_sp = [10,20,30,40]
test_sp.splice(0,1,999)                 //*splice(ตำแหน่งที่จะลบ,จำนวนที่จะลบ,จำนวนที่จะแทนที่) */  splice จะเป็นการลบ 
const test_1 = test_sp.splice(0,1)                             //*ถ้าสร้างตัวแปลมารับค่า จะได้ค่าเท่ากับ 10 เพราะจะเก็บค่าตัวแปลที่เรานำออกไว้
console.log(test_1)                             //*ถ้าสร้างตัวแปลมารับค่า จะได้ค่าเท่ากับ 999 เพราะจะเก็บค่าตัวแปลในตำแหน่งที่เรานำออกไว้



const test_sp1 = [10,20,30,40]
test_sp1.slice(1,3)         //*splice(ตำแหน่งเริ่มต้น',จำนวนสุดท้าย-1) */  splice จะเป็นการลบ (ต้องสร้างตัวแปลมารับค่า ไม่งั้นจะข้อมูลจะออกมาเป็นเหมือนเดิม)

// console.log(test_sp1)  