


// multiline string สามารถงานกับข้อความยาวๆได้ โดยการขึ้นบรรทัดใหม่แล้วไม่มีข้อผิดพลาก

// 1 กำหนดตัวแปล address โดยใส่ข้อความให้อยู่ใน ''

const address = 'ชื่อ : วีระพล ที่อยู่ : สมุทรสาุคร โทรศัพ : 0882388376'

console.log(address)

// 2 โดยเปลี่ยน ''  เป็น  `` (อยู่ในปุ่มเปลียนภาษา  *ถ้าไม่เปลี่ยนตัวข้อมูลข้างในจะได้แค่บรรทัดเดี่ยวกัน ไม่สามารถขึ้นบรรทัดใหม่ได้ ) 




const address2 = `ชื่อ : วีระพล 
อยู่ : สมุทรสาุคร 
โทรศัพ : 0882388376`

console.log(address2)



// interpolation แทรกตัวแปล name ไปในพื่นที่ String ได้ โดยใข้  ${ชือตัวแปล} 
//เพื่มตัวแปลและแทนที่ โดยใส่   ${ชือตัวแปล}

let name = "โมโม่"

const address3 = `ชื่อ : ${name} 
อยู่ : สมุทรสาุคร 
โทรศัพ : 0882388376`

console.log(address3)